/*Задатак 1. (24 поена) потребно је направити софтвер за вођење евиденције о једном кругу такмичења талената.
За сваког учесника се памти редни број, име презиме и поени публике. Учесник може бити глумац или певач Глумца карактерише
број потребних реквизита, број поена жирија за идеју и број поена жирија за извођење за певача се води евиденција о 
песми коју пева, броју пратећих инструмената, броју пратећих вокала и поенима музичког жирија Учесник пролази у наредни кругž
такмичења уколико има минимум 50% поена оцењивана жирија и ако у укупном броју поена има више од 100 поена. Музички жири 
додељује после од 0 до 100, док жири за идеју и жири за извођење додељује поене од 0 до 50. Поени публике су у опсегу од 0 до 100.
Укупан број поена за глумце се рачуна као сума гласова публике, поена жирија за идеју и поена жирија за извођење, док се укупан 
број поена за певаче рачуна као збир гласова публике и поена музичког жирија: спречити креирање такмичара да невалидним бројем poena


Омогућити додавање новог и бриса постојећег учесника на основу учесниковог редног броја Могуће је одредити средњу вредност
укупног броја поена учесника који су се пласирали у следећи круг и учесника који је освоји највећи број поена жирија. 
Могуће је приказати евиденцију учесника уписом свих података у фајл Омогућити сортираье учесника у опадајући редослед по броју
помоћног особља за извођење наступа. Број помоћног особља за глумца се рачуна као 1% броја реквизита, док се број помоћног 
особља за певача рачуна као збир пратећих инструмената и пратећих вокала

*/

#include<iostream>
#include<string>

using namespace std;


class Ucesnik{
    int redniBroj;
    string imeIPrezime;
    int poeniPublike;

};

int main(){

    return 0;
}