/*Напишите Ц++ програм који ће илустровати употребу Пуре виртуелне функције. 
Ево једноставног Ц++ програма који илуструје употребу Пуре виртуелне функције у Ц++ програмском језику
Класа која се не користи за креирање објеката назива се апстрактна класа.
Једина сврха апстрактне класе је да делује као основна класа.
Апстрактна класа је потребна када основна класа није у стању да креира смислену имплементацију за функцију члана.
На пример, на следећој слици, класа Схапе представља апстрактни концепт за који објекти не могу постојати.
Облик има смисла само као основа неке класе изведене из њега.
То се види из чињенице да није могуће дати разумне дефиниције за његове виртуелне функције.
Боља алтернатива је да се виртуелна функција класе Схапе прогласи за чисте виртуелне функције.
Виртуелна функција постаје чиста помоћу иницијализатора, = 0. Дакле, виртуелне функције у апстрактној базној класи могу бити чисте као: */