/*
Направите једноставну хијерархију „облика“: базна класа тзв
Облик и изведене класе под називом Круг, квадрат и троугао.
У основној класи направите виртуелну функцију која се зове драв () и замените је у изведеним класама.
Направите низ показивача на објекте Схапе које креирате на хрпи (и тако извршите упцастинг показивача),
и позовите драв () кроз показиваче основне класе, да бисте проверили понашање виртуелне функције.
Ако ваш програм за отклањање грешака то подржава, прођите кроз цод у једном кораку

*/

#include<iostream>
#include <type_traits>

using namespace std;

class Shape{
    virtual void draw(){
        .
    }

};

class Circle : Shape {


};

class Square : Shape{

};
class Triangle{

};


int main(){
    
    return 0;
}